; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	satellite2 - satellite
	instrument6 - instrument
	satellite3 - satellite
	instrument7 - instrument
	infrared0 - mode
	image1 - mode
	Star6 - direction
	Star4 - direction
	GroundStation0 - direction
	Star5 - direction
	Star3 - direction
	Star2 - direction
	GroundStation1 - direction
	Planet7 - direction
	Planet8 - direction
	Planet9 - direction
	Star10 - direction
	Star11 - direction
	Planet12 - direction
	Phenomenon13 - direction
)
(:init
	(supports instrument0 image1)
	(calibration_target instrument0 Star3)
	(supports instrument1 infrared0)
	(supports instrument1 image1)
	(calibration_target instrument1 GroundStation0)
	(supports instrument2 infrared0)
	(supports instrument2 image1)
	(calibration_target instrument2 Star4)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star11)
	(supports instrument3 infrared0)
	(calibration_target instrument3 GroundStation0)
	(calibration_target instrument3 GroundStation1)
	(supports instrument4 infrared0)
	(calibration_target instrument4 Star3)
	(supports instrument5 infrared0)
	(supports instrument5 image1)
	(calibration_target instrument5 Star3)
	(calibration_target instrument5 Star5)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(on_board instrument5 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon13)
	(supports instrument6 infrared0)
	(supports instrument6 image1)
	(calibration_target instrument6 Star2)
	(on_board instrument6 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Planet7)
	(supports instrument7 infrared0)
	(supports instrument7 image1)
	(calibration_target instrument7 GroundStation1)
	(calibration_target instrument7 Star2)
	(on_board instrument7 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star2)
)
(:goal (and
	(pointing satellite0 Star10)
	(have_image Planet7 image1)
	(have_image Planet8 image1)
	(have_image Planet9 image1)
	(have_image Star10 infrared0)
	(have_image Star11 infrared0)
	(have_image Planet12 image1)
	(have_image Phenomenon13 image1)
))

)

; plan
1. (switch_on instrument7 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument7)
   goals met: 0 of 8
2. (calibrate satellite3 instrument7 star2)
   added: (calibrated instrument7)
   goals met: 0 of 8
3. (turn_to satellite3 planet8 star2)
   deleted: (pointing satellite3 star2)
   added: (pointing satellite3 planet8)
   goals met: 0 of 8
4. (take_image satellite3 planet8 instrument7 image1)
   added: (have_image planet8 image1)
   goals met: 1 of 8
5. (turn_to satellite3 planet7 planet8)
   deleted: (pointing satellite3 planet8)
   added: (pointing satellite3 planet7)
   goals met: 1 of 8
6. (take_image satellite3 planet7 instrument7 image1)
   added: (have_image planet7 image1)
   goals met: 2 of 8
7. (turn_to satellite3 planet12 planet7)
   deleted: (pointing satellite3 planet7)
   added: (pointing satellite3 planet12)
   goals met: 2 of 8
8. (take_image satellite3 planet12 instrument7 image1)
   added: (have_image planet12 image1)
   goals met: 3 of 8
9. (turn_to satellite3 phenomenon13 planet12)
   deleted: (pointing satellite3 planet12)
   added: (pointing satellite3 phenomenon13)
   goals met: 3 of 8
10. (take_image satellite3 phenomenon13 instrument7 image1)
   added: (have_image phenomenon13 image1)
   goals met: 4 of 8
11. (turn_to satellite0 star10 star11)
   deleted: (pointing satellite0 star11)
   added: (pointing satellite0 star10)
   goals met: 5 of 8
12. (turn_to satellite3 planet9 phenomenon13)
   deleted: (pointing satellite3 phenomenon13)
   added: (pointing satellite3 planet9)
   goals met: 5 of 8
13. (take_image satellite3 planet9 instrument7 image1)
   added: (have_image planet9 image1)
   goals met: 6 of 8
14. (turn_to satellite3 star10 planet9)
   deleted: (pointing satellite3 planet9)
   added: (pointing satellite3 star10)
   goals met: 6 of 8
15. (take_image satellite3 star10 instrument7 infrared0)
   added: (have_image star10 infrared0)
   goals met: 7 of 8
16. (turn_to satellite3 star11 star10)
   deleted: (pointing satellite3 star10)
   added: (pointing satellite3 star11)
   goals met: 7 of 8
17. (take_image satellite3 star11 instrument7 infrared0)
   added: (have_image star11 infrared0)
   goals met: 8 of 8
